bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/std_drv/src/bl702l_pwm.c
/**
  ******************************************************************************
  * @file    bl702l_pwm.c
  * @version V1.0
  * @date
  * @brief   This file is the standard driver c file
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

#include "bl702l_pwm.h"
#include "bl702l_pwm_sc.h"
#include "bl702l_glb.h"

/** @addtogroup  BL702l_Peripheral_Driver
 *  @{
 */

/** @addtogroup  PWM
 *  @{
 */

/** @defgroup  PWM_Private_Macros
 *  @{
 */
#define PWMx_Get_Reg_Addr(id)  (PWM_BASE + (id)*0x80)
#define PWM_INT_TIMEOUT_COUNT  (160 * 1000)
#define PWM_STOP_TIMEOUT_COUNT (160 * 1000)

/*@} end of group PWM_Private_Macros */

/** @defgroup  PWM_Private_Types
 *  @{
 */

/*@} end of group PWM_Private_Types */

/** @defgroup  PWM_Private_Variables
 *  @{
 */

/**
 *  @brief PWM interrupt callback function address array
*/
#ifndef BFLB_USE_HAL_DRIVER
static intCallback_Type *PWMIntCbfArra[PWMx_ID_MAX][PWM_INT_ALL] = {
    { NULL }
};
#endif
/*@} end of group PWM_Private_Variables */

/** @defgroup  PWM_Global_Variables
 *  @{
 */

/*@} end of group PWM_Global_Variables */

/** @defgroup  PWM_Private_Fun_Declaration
 *  @{
 */
#ifndef BFLB_USE_HAL_DRIVER
static BL_Err_Type PWM_IntHandler(IRQn_Type intPeriph);
#endif

/*@} end of group PWM_Private_Fun_Declaration */

/** @defgroup  PWM_Private_Functions
 *  @{
 */

/****************************************************************************/ /**
 * @brief  PWM interrupt handle
 *
 * @param  None
 *
 * @return SUCCESS
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
static BL_Err_Type PWM_IntHandler(IRQn_Type intPeriph)
{
    uint32_t tmpVal0 = 0;
    uint32_t tmpVal1 = 0;
    uint32_t maskVal = 0;
    uint32_t timeoutCnt = PWM_INT_TIMEOUT_COUNT;
    uint32_t PWMx;
    uint16_t intIndex;
    PWMx_ID_Type id;

    for (id = PWM0_ID; id < PWMx_ID_MAX; id++) {
        /* Get PWMx start register address */
        PWMx = PWMx_Get_Reg_Addr(id);
        tmpVal0 = BL_RD_REG(PWMx, PWM_INT_CONFIG);
        if (((BL_GET_REG_BITS_VAL(tmpVal0, PWM_SC0_INT_STS) & (1 << PWM_SC0_INT_STS_POS)) != 0)) {
            /* Clear interrupt */
            tmpVal0 |= (1 << (PWM_SC0_INT_CLR_POS));
            BL_WR_REG(PWMx, PWM_INT_CONFIG, tmpVal0);

            if (BL_GET_REG_BITS_VAL(BL_RD_REG(PWMx, PWM0_SC0_CONFIG), PWM_SC0_STOP_ON_INT) == 1) {
                PWM_SC_Channel_Disable(PWM_SC0);
            }

            /* FIXME: we need set pwm_int_clear to 0 by software and
               before this,we must make sure pwm_interrupt_sts is 0*/
            do {
                tmpVal0 = BL_RD_REG(PWMx, PWM_INT_CONFIG);
                timeoutCnt--;

                if (timeoutCnt == 0) {
                    break;
                }
            } while (BL_GET_REG_BITS_VAL(tmpVal0, PWM_SC0_INT_STS) & (1 << (PWM_SC0_INT_STS_POS)));

            tmpVal0 &= (~(1 << (PWM_SC0_INT_CLR_POS)));
            BL_WR_REG(PWMx, PWM_INT_CONFIG, tmpVal0);

            if (PWMIntCbfArra[id][PWM_INT_PULSE_CNT] != NULL) {
                /* Call the callback function */
                PWMIntCbfArra[id][PWM_INT_PULSE_CNT]();
            }
        }
        if (((BL_GET_REG_BITS_VAL(tmpVal0, PWM_MC0_INT_STS) & (1 << PWM_MC0_INT_STS_POS)) != 0)) {
            tmpVal1 = BL_RD_REG(PWMx, PWM_MC0_INT_STS);
            maskVal = BL_RD_REG(PWMx, PWM_MC0_INT_MASK);
            for (intIndex = 0; intIndex < PWM_INT_ALL; intIndex++) {
                if (((1 << intIndex) & tmpVal1) && (((1 << intIndex) & maskVal) == 0)) {
                    if (intIndex == PWM_INT_REPT) {
                        if (BL_GET_REG_BITS_VAL(BL_RD_REG(PWMx, PWM_MC0_CONFIG0), PWM_STOP_ON_REPT) == 1) {
                            PWMx_Disable(id);
                        }
                    }
                    BL_WR_REG(PWMx, PWM_MC0_INT_CLEAR, 1 << intIndex);
                    if (PWMIntCbfArra[id][intIndex] != NULL) {
                        PWMIntCbfArra[id][intIndex]();
                    }
                }
            }
        }
    }
    return SUCCESS;
}

#endif

/*@} end of group PWM_Private_Functions */

