bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/std_drv/src/bl702l_pwm.c
/** @defgroup  PWM_Public_Functions
 *  @{
 */

/****************************************************************************/ /**
 * @brief  PWMx init
 *
 * @param  id: PWM ID
 * @param  chCfg: PWMx configuration
 *
 * @return SUCCESS
 *
*******************************************************************************/
BL_Err_Type PWMx_Init(PWMx_ID_Type id, PWMx_CFG_Type *cfg)
{
    uint32_t tmpVal;
    uint32_t timeoutCnt = PWM_STOP_TIMEOUT_COUNT;
    /* Get PWMx start register address */
    uint32_t PWMx = PWMx_Get_Reg_Addr(id);

    /* Check the parameters */
    CHECK_PARAM(IS_PWMx_ID_TYPE(id));
    CHECK_PARAM(IS_PWM_CLK_TYPE(cfg->clk));
    CHECK_PARAM(IS_PWM_STOP_MODE_TYPE(cfg->stopMode));
    CHECK_PARAM(IS_PWM_EXT_BREAK_POLARITY_TYPE(cfg->extPol));
    CHECK_PARAM(IS_PWM_TRIGADC_SOURCE_TYPE(cfg->adcSrc));

    /* Ungate pwm clock gate */
    GLB_PER_Clock_UnGate(GLB_AHB_CLOCK_PWM);

    /* Config pwm config0 */
    tmpVal = BL_RD_REG(PWMx, PWM_MC0_CONFIG0);
    BL_WR_REG(PWMx, PWM_MC0_CONFIG0, BL_SET_REG_BIT(tmpVal, PWM_STOP_EN));
    while (!BL_IS_REG_BIT_SET(BL_RD_REG(PWMx, PWM_MC0_CONFIG0), PWM_STS_STOP)) {
        timeoutCnt--;
        if (timeoutCnt == 0) {
            return TIMEOUT;
        }
    }
    tmpVal = BL_RD_REG(PWMx, PWM_MC0_CONFIG0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_REG_CLK_SEL, cfg->clk);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_STOP_MODE, cfg->stopMode);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_EXT_BREAK_PL, cfg->extPol);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_ADC_TRG_SRC, cfg->adcSrc);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_STOP_ON_REPT, cfg->stpRept);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CLK_DIV, cfg->clkDiv);
    BL_WR_REG(PWMx, PWM_MC0_CONFIG0, tmpVal);

    /* Config pwm period and rept count */
    tmpVal = BL_RD_REG(PWMx, PWM_MC0_PERIOD);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_PERIOD, cfg->period);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_INT_PERIOD_CNT, cfg->intPulseCnt);
    BL_WR_REG(PWMx, PWM_MC0_PERIOD, tmpVal);

#ifndef BFLB_USE_HAL_DRIVER
    Interrupt_Handler_Register(PWM_IRQn, PWM_IRQHandler);
#endif

    return SUCCESS;
}

/****************************************************************************/ /**
 * @brief  PWMx update clock divider
 *
 * @param  id: PWM ID
 * @param  div: Clock divider
 *
 * @return None
 *
*******************************************************************************/
void PWMx_Div_Set(PWMx_ID_Type id, uint16_t div)
{
    uint32_t tmpVal;
    //* Get PWMx start register address */
    uint32_t PWMx = PWMx_Get_Reg_Addr(id);

    /* Check the parameters */
    CHECK_PARAM(IS_PWMx_ID_TYPE(id));

    tmpVal = BL_RD_REG(PWMx, PWM_MC0_CONFIG0);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CLK_DIV, div);
    BL_WR_REG(PWMx, PWM_MC0_CONFIG0, tmpVal);
}

/****************************************************************************/ /**
 * @brief  PWMx update period
 *
 * @param  id: PWM ID
 * @param  period: period
 *
 * @return None
 *
*******************************************************************************/
void PWMx_Period_Set(PWMx_ID_Type id, uint16_t period)
{
    uint32_t tmpVal;
    /* Get PWMx start register address */
    uint32_t PWMx = PWMx_Get_Reg_Addr(id);

    /* Check the parameters */
    CHECK_PARAM(IS_PWMx_ID_TYPE(id));

    /* Config pwm period and duty */
    tmpVal = BL_RD_REG(PWMx, PWM_MC0_PERIOD);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_PERIOD, period);
    BL_WR_REG(PWMx, PWM_MC0_PERIOD, tmpVal);
}

/****************************************************************************/ /**
 * @brief  PWMx get configuration
 *
 * @param  id: PWM ID
 * @param  period: period pointer
 *
 * @return None
 *
*******************************************************************************/
void PWMx_Period_Get(PWMx_ID_Type id, uint16_t *period)
{
    uint32_t tmpVal;
    /* Get PWMx start register address */
    uint32_t PWMx = PWMx_Get_Reg_Addr(id);

    /* Check the parameters */
    CHECK_PARAM(IS_PWMx_ID_TYPE(id));

    /* get pwm period */
    tmpVal = BL_RD_REG(PWMx, PWM_MC0_PERIOD);
    *period = BL_GET_REG_BITS_VAL(tmpVal, PWM_PERIOD);
}

/****************************************************************************/ /**
 * @brief  PWMx enable
 *
 * @param  id: PWMx ID
 *
 * @return None
 *
*******************************************************************************/
void PWMx_Enable(PWMx_ID_Type id)
{
    uint32_t tmpVal;
    /* Get PWMx start register address */
    uint32_t PWMx = PWMx_Get_Reg_Addr(id);

    /* Check the parameters */
    CHECK_PARAM(IS_PWMx_ID_TYPE(id));

    /* Config pwm clock to enable pwm */
    tmpVal = BL_RD_REG(PWMx, PWM_MC0_CONFIG0);
    BL_WR_REG(PWMx, PWM_MC0_CONFIG0, BL_CLR_REG_BIT(tmpVal, PWM_STOP_EN));
}

/****************************************************************************/ /**
 * @brief  PWMx disable
 *
 * @param  id: PWMx ID
 *
 * @return None
 *
*******************************************************************************/
void PWMx_Disable(PWMx_ID_Type id)
{
    uint32_t tmpVal;
    /* Get PWMx start register address */
    uint32_t PWMx = PWMx_Get_Reg_Addr(id);

    /* Check the parameters */
    CHECK_PARAM(IS_PWM_CH_ID_TYPE(id));

    /* Config pwm clock to disable pwm */
    tmpVal = BL_RD_REG(PWMx, PWM_MC0_CONFIG0);
    BL_WR_REG(PWMx, PWM_MC0_CONFIG0, BL_SET_REG_BIT(tmpVal, PWM_STOP_EN));
}

void PWM_Channelx_Init(PWMx_ID_Type id, PWM_CHx_Type ch, PWM_CHx_CFG_Type *cfg)
{
    uint32_t tmpVal;
    /* Get PWMx start register address */
    uint32_t PWMx = PWMx_Get_Reg_Addr(id);

    /* Check the parameters */
    CHECK_PARAM(IS_PWMx_ID_TYPE(id));
    CHECK_PARAM(IS_PWM_CHx_TYPE(ch));
    CHECK_PARAM(IS_PWM_MODE_TYPE(cfg->modP));
    CHECK_PARAM(IS_PWM_MODE_TYPE(cfg->modN));
    CHECK_PARAM(IS_PWM_POLARITY_TYPE(cfg->polP));
    CHECK_PARAM(IS_PWM_POLARITY_TYPE(cfg->polN));
    CHECK_PARAM(IS_PWM_IDLE_STATE_TYPE(cfg->idlP));
    CHECK_PARAM(IS_PWM_IDLE_STATE_TYPE(cfg->idlN));
    CHECK_PARAM(IS_PWM_BREAK_STATE_TYPE(cfg->brkP));
    CHECK_PARAM(IS_PWM_BREAK_STATE_TYPE(cfg->brkN));

    /* Config pwm config1 */
    tmpVal = BL_RD_REG(PWMx, PWM_MC0_CONFIG1);
    switch (ch) {
        case PWM_CH0:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH0_PEN, cfg->modP);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH0_NEN, cfg->modN);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH0_PPL, cfg->polP);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH0_NPL, cfg->polN);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH0_PSI, cfg->idlP);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH0_NSI, cfg->idlN);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH0_PBS, cfg->brkP);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH0_NBS, cfg->brkN);
            break;
        case PWM_CH1:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH1_PEN, cfg->modP);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH1_NEN, cfg->modN);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH1_PPL, cfg->polP);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH1_NPL, cfg->polN);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH1_PSI, cfg->idlP);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH1_NSI, cfg->idlN);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH1_PBS, cfg->brkP);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH1_NBS, cfg->brkN);
            break;
        case PWM_CH2:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH2_PEN, cfg->modP);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH2_NEN, cfg->modN);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH2_PPL, cfg->polP);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH2_NPL, cfg->polN);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH2_PSI, cfg->idlP);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH2_NSI, cfg->idlN);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH2_PBS, cfg->brkP);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH2_NBS, cfg->brkN);
            break;
        case PWM_CH3:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH3_PEN, cfg->modP);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH3_NEN, cfg->modN);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH3_PPL, cfg->polP);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH3_NPL, cfg->polN);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH3_PSI, cfg->idlP);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH3_NSI, cfg->idlN);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH3_PBS, cfg->brkP);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH3_NBS, cfg->brkN);
            break;
        default:
            break;
    }
    BL_WR_REG(PWMx, PWM_MC0_CONFIG1, tmpVal);

    /* Config pwm thresholdL and thresholdH */
    switch (ch) {
        case PWM_CH0:
            tmpVal = BL_RD_REG(PWMx, PWM_MC0_CH0_THRE);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH0_THREL, cfg->thresholdL);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH0_THREH, cfg->thresholdH);
            BL_WR_REG(PWMx, PWM_MC0_CH0_THRE, tmpVal);
            break;
        case PWM_CH1:
            tmpVal = BL_RD_REG(PWMx, PWM_MC0_CH1_THRE);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH1_THREL, cfg->thresholdL);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH1_THREH, cfg->thresholdH);
            BL_WR_REG(PWMx, PWM_MC0_CH1_THRE, tmpVal);
            break;
        case PWM_CH2:
            tmpVal = BL_RD_REG(PWMx, PWM_MC0_CH2_THRE);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH2_THREL, cfg->thresholdL);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH2_THREH, cfg->thresholdH);
            BL_WR_REG(PWMx, PWM_MC0_CH2_THRE, tmpVal);
            break;
        case PWM_CH3:
            tmpVal = BL_RD_REG(PWMx, PWM_MC0_CH3_THRE);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH3_THREL, cfg->thresholdL);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH3_THREH, cfg->thresholdH);
            BL_WR_REG(PWMx, PWM_MC0_CH3_THRE, tmpVal);
            break;
        default:
            break;
    }

    /* Config pwm dead time */
    tmpVal = BL_RD_REG(PWMx, PWM_MC0_DEAD_TIME);
    switch (ch) {
        case PWM_CH0:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH0_DTG, cfg->dtg);
            break;
        case PWM_CH1:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH1_DTG, cfg->dtg);
            break;
        case PWM_CH2:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH2_DTG, cfg->dtg);
            break;
        case PWM_CH3:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH3_DTG, cfg->dtg);
            break;
        default:
            break;
    }
    BL_WR_REG(PWMx, PWM_MC0_DEAD_TIME, tmpVal);
}

