bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/std_drv/src/bl702l_pwm.c
void PWM_Channelx_Positive_Polarity_Set(PWMx_ID_Type id, PWM_CHx_Type ch, PWM_Polarity_Type pol)
{
    uint32_t tmpVal;
    /* Get PWMx start register address */
    uint32_t PWMx = PWMx_Get_Reg_Addr(id);

    /* Check the parameters */
    CHECK_PARAM(IS_PWMx_ID_TYPE(id));
    CHECK_PARAM(IS_PWM_CHx_TYPE(ch));
    CHECK_PARAM(IS_PWM_POLARITY_TYPE(pol));

    /* Config pwm config1 */
    tmpVal = BL_RD_REG(PWMx, PWM_MC0_CONFIG1);
    switch (ch) {
        case PWM_CH0:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH0_PPL, pol);
            break;
        case PWM_CH1:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH1_PPL, pol);
            break;
        case PWM_CH2:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH2_PPL, pol);
            break;
        case PWM_CH3:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH3_PPL, pol);
            break;
        default:
            break;
    }
    BL_WR_REG(PWMx, PWM_MC0_CONFIG1, tmpVal);
}

void PWM_Channelx_Negative_Polarity_Set(PWMx_ID_Type id, PWM_CHx_Type ch, PWM_Polarity_Type pol)
{
    uint32_t tmpVal;
    /* Get PWMx start register address */
    uint32_t PWMx = PWMx_Get_Reg_Addr(id);

    /* Check the parameters */
    CHECK_PARAM(IS_PWMx_ID_TYPE(id));
    CHECK_PARAM(IS_PWM_CHx_TYPE(ch));
    CHECK_PARAM(IS_PWM_POLARITY_TYPE(pol));

    /* Config pwm config1 */
    tmpVal = BL_RD_REG(PWMx, PWM_MC0_CONFIG1);
    switch (ch) {
        case PWM_CH0:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH0_NPL, pol);
            break;
        case PWM_CH1:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH1_NPL, pol);
            break;
        case PWM_CH2:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH2_NPL, pol);
            break;
        case PWM_CH3:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH3_NPL, pol);
            break;
        default:
            break;
    }
    BL_WR_REG(PWMx, PWM_MC0_CONFIG1, tmpVal);
}

void PWM_Channelx_Idle_State_Set(PWMx_ID_Type id, PWM_CHx_Type ch, PWM_Idle_State_Type idlP, PWM_Idle_State_Type idlN)
{
    uint32_t tmpVal;
    /* Get PWMx start register address */
    uint32_t PWMx = PWMx_Get_Reg_Addr(id);

    /* Check the parameters */
    CHECK_PARAM(IS_PWMx_ID_TYPE(id));
    CHECK_PARAM(IS_PWM_CHx_TYPE(ch));
    CHECK_PARAM(IS_PWM_IDLE_STATE_TYPE(idlP));
    CHECK_PARAM(IS_PWM_IDLE_STATE_TYPE(idlN));

    /* Config pwm config1 */
    tmpVal = BL_RD_REG(PWMx, PWM_MC0_CONFIG1);
    switch (ch) {
        case PWM_CH0:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH0_PSI, idlP);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH0_NSI, idlN);
            break;
        case PWM_CH1:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH1_PSI, idlP);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH1_NSI, idlN);
            break;
        case PWM_CH2:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH2_PSI, idlP);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH2_NSI, idlN);
            break;
        case PWM_CH3:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH3_PSI, idlP);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH3_NSI, idlN);
            break;
        default:
            break;
    }
    BL_WR_REG(PWMx, PWM_MC0_CONFIG1, tmpVal);
}

void PWM_Channelx_Positive_Idle_State_Set(PWMx_ID_Type id, PWM_CHx_Type ch, PWM_Idle_State_Type idl)
{
    uint32_t tmpVal;
    /* Get PWMx start register address */
    uint32_t PWMx = PWMx_Get_Reg_Addr(id);

    /* Check the parameters */
    CHECK_PARAM(IS_PWMx_ID_TYPE(id));
    CHECK_PARAM(IS_PWM_CHx_TYPE(ch));
    CHECK_PARAM(IS_PWM_IDLE_STATE_TYPE(idl));

    /* Config pwm config1 */
    tmpVal = BL_RD_REG(PWMx, PWM_MC0_CONFIG1);
    switch (ch) {
        case PWM_CH0:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH0_PSI, idl);
            break;
        case PWM_CH1:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH1_PSI, idl);
            break;
        case PWM_CH2:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH2_PSI, idl);
            break;
        case PWM_CH3:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH3_PSI, idl);
            break;
        default:
            break;
    }
    BL_WR_REG(PWMx, PWM_MC0_CONFIG1, tmpVal);
}

void PWM_Channelx_Negative_Idle_State_Set(PWMx_ID_Type id, PWM_CHx_Type ch, PWM_Idle_State_Type idl)
{
    uint32_t tmpVal;
    /* Get PWMx start register address */
    uint32_t PWMx = PWMx_Get_Reg_Addr(id);

    /* Check the parameters */
    CHECK_PARAM(IS_PWMx_ID_TYPE(id));
    CHECK_PARAM(IS_PWM_CHx_TYPE(ch));
    CHECK_PARAM(IS_PWM_IDLE_STATE_TYPE(idl));

    /* Config pwm config1 */
    tmpVal = BL_RD_REG(PWMx, PWM_MC0_CONFIG1);
    switch (ch) {
        case PWM_CH0:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH0_NSI, idl);
            break;
        case PWM_CH1:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH1_NSI, idl);
            break;
        case PWM_CH2:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH2_NSI, idl);
            break;
        case PWM_CH3:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH3_NSI, idl);
            break;
        default:
            break;
    }
    BL_WR_REG(PWMx, PWM_MC0_CONFIG1, tmpVal);
}

void PWM_Channelx_Break_State_Set(PWMx_ID_Type id, PWM_CHx_Type ch, PWM_Break_State_Type brkP, PWM_Break_State_Type brkN)
{
    uint32_t tmpVal;
    /* Get PWMx start register address */
    uint32_t PWMx = PWMx_Get_Reg_Addr(id);

    /* Check the parameters */
    CHECK_PARAM(IS_PWMx_ID_TYPE(id));
    CHECK_PARAM(IS_PWM_CHx_TYPE(ch));
    CHECK_PARAM(IS_PWM_BREAK_STATE_TYPE(brkP));
    CHECK_PARAM(IS_PWM_BREAK_STATE_TYPE(brkN));

    /* Config pwm config1 */
    tmpVal = BL_RD_REG(PWMx, PWM_MC0_CONFIG1);
    switch (ch) {
        case PWM_CH0:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH0_PBS, brkP);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH0_NBS, brkN);
            break;
        case PWM_CH1:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH1_PBS, brkP);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH1_NBS, brkN);
            break;
        case PWM_CH2:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH2_PBS, brkP);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH2_NBS, brkN);
            break;
        case PWM_CH3:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH3_PBS, brkP);
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_CH3_NBS, brkN);
            break;
        default:
            break;
    }
    BL_WR_REG(PWMx, PWM_MC0_CONFIG1, tmpVal);
}

